---
kind: enumMember
id: F:Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationLeft
enum: Autodesk.Revit.DB.AssemblyDetailViewOrientation
source: html/941c2468-0a94-b2c0-0c73-1953e15487d6.htm
---
# Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationLeft

The Detail View will be oriented vertically, with its cut plane along the left face of the assembly's bounding box, looking into the bounding box.